In [1]:
import numpy as np
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [3]:
obj=pd.Series([4, 7, -5, 3])

In [4]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
obj.array

<NumpyExtensionArray>
[4, 7, -5, 3]
Length: 4, dtype: int64

In [6]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2=pd.Series([4, 7, -5, 3], index=["d", "b", "a", "c"])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2["a"]

np.int64(-5)

In [10]:
obj2["d"] = 6

In [11]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2[["c", "a", "d"]]

c    3
a   -5
d    6
dtype: int64

In [13]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [14]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [15]:
import numpy as np

In [16]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
"b" in obj2
"e" in obj2

False

In [18]:
"b" in obj2

True

In [19]:
"z" in obj2

False

In [20]:
sdata={"Ohio":35000, "Texas":71000, "Oregon":16000, "Utah":5000}

In [21]:
obj3=pd.Series(sdata)

In [22]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [23]:
obj3.to_dict()

{'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [24]:
states=["California", "Ohio", "Oregon", "Texas"]

In [25]:
obj4=pd.Series(sdata,index=states)

In [26]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [27]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [29]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [30]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [31]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [32]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [33]:
obj4.name="population"

In [34]:
obj4.index.name="state"

In [35]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [36]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [37]:
obj.index=["Bob", "Steve", "Jeff", "Ryan"]
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [38]:
data = {"state":["Ohio","Ohio","Ohio","Nevada","Nevada","Nevada"],
    "year":[2000,2001,2002,2001,2002,2003],
    "pop":[1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)

In [39]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [40]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [41]:
frame.tail()

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [42]:
pd.DataFrame(data,columns=["year","state","pop"])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [43]:
# Assigning columns
frame2 = pd.DataFrame(data,columns=["year","state","pop","debt"])

In [44]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [45]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [46]:
frame2["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [47]:
# pulling out a column can also work with dot attribute notation.
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [48]:
# Retreiving row data
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [49]:
frame2.loc[0]

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: 0, dtype: object

In [50]:
frame2.loc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [51]:
# modifying uniform value to a column
frame2["debt"] = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [52]:
frame2.debt = 16.5
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [53]:
# Modifying scalar value to a column
frame2["debt"] = np.arange(6.)
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [54]:
# Assigning lists or arrays to a column, value's length must match the length of DataFrame.
val = pd.Series([-1.2, -1.5, -1.7], index=["two","four","five"])
frame2["debt"] = val
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   NaN
1  2001    Ohio  1.7   NaN
2  2002    Ohio  3.6   NaN
3  2001  Nevada  2.4   NaN
4  2002  Nevada  2.9   NaN
5  2003  Nevada  3.2   NaN

In [55]:
# Assigning a column that doesn't exist creates a new column.
# Adding a new column of Boolean values
frame2["eastern"]=frame2["state"] == "Ohio"
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   NaN     True
1  2001    Ohio  1.7   NaN     True
2  2002    Ohio  3.6   NaN     True
3  2001  Nevada  2.4   NaN    False
4  2002  Nevada  2.9   NaN    False
5  2003  Nevada  3.2   NaN    False

In [56]:
# del keyword will delete columns like with a dictionary.
del frame2["eastern"]
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [57]:
# nested dictionary of dictionaries
populations = {"Ohio":{2000:1.5,2001:1.7,2002:3.6},
        "Nevada":{2001:2.4,2002:2.9}}
populations

{'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}, 'Nevada': {2001: 2.4, 2002: 2.9}}

In [58]:
import pandas as pd
import numpy as np
frame3 = pd.DataFrame(populations)
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [59]:
# transposing DataFrame / if columns do not all have same data type, transposing dicards the column data types
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [60]:
# keys in the inner dictionaries are combined to index, if index is assigned
pd.DataFrame(populations,index=[2001,2002,2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [61]:
# dictionaries in Series are treated much in the same way
# {key:data[column to pull from][start index:stop index]} 0=first index, -1:exclude last index by 1
# The third spot in the brackets is the Step: [Start : Stop : Step]
# 1: Take every item (default).
# 2: Take every other item (skip one).
#-1: Walk backwards through the list.

pdata = {"Ohio":frame3["Ohio"][:-1],
    "Nevada":frame3["Nevada"][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [62]:
# Possible data inputs
# 2D/nd array: A matrix of data 
# Dictionary of arrays, lists or tuples: each array/list/tuple becomes a column in DataFrame; all squences must have same length
# Dictionary of Series: Each value becomes column; Indices of each Series are unioned together to form row index
# Dictionary of Dictionaries: Each inner dictionary becomes a column; keys are unioned from the row index
# List of dictionaries or Series: Each item becomes a row in DataFrame; unions of dictionary keys or Series indices become the column labels
# List of lists or tuples: equal to 2D ndarray
# Another DataFrame: The DataFrame's index is used unless different ones are passed

In [63]:
# If DataFrame's index and columns have names set, they will be displayed
frame3.index.name = "year"
frame3.columns.name = "state"
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [64]:
# DataFrame does not have name. DataFrame converted to numpy returns the data contained in 2D ndarray.
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [65]:
# If DataFrame's columns are different data types, data type of the returned array will accomodate all columns
frame2.to_numpy()

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, nan],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, nan],
       [2002, 'Nevada', 2.9, nan],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [66]:
# any array or sequence labels to Series or DataFrame is coverted to an index
obj = pd.Series(np.arange(3),index=["a","b","c"])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [67]:
index[1:]

Index(['b', 'c'], dtype='object')

In [68]:
# Index objects cannot change
index[1] = "d"  # gives TypeError

TypeError: Index does not support mutable operations

In [ ]:
# immutability (unable to change) makes it safer to share index ojbects among data structures
labels = pd.Index(np.arange(3))
labels

In [ ]:
obj2 = pd.Series([1.5,-2.5,0],index=labels)
obj2

In [ ]:
# checking if index matches variable 
obj2.index is labels

In [ ]:
frame3

In [ ]:
frame3.columns

In [ ]:
"Ohio" in frame3.columns

In [ ]:
2003 in frame3.index

In [ ]:
# pandas index can contain duplicate labels
pd.Index(["foo","foo","bar","bar"])

In [ ]:
# Some Index methods and properties
# append(): Concatenate with additional index objects
# difference(): Compute set difference as index
# instersection(): Compute set intersection
# union(): Compute set union
# isin(): Compute Boolean array indicating whether each value is contained
# delete(): COmpute new Index with element at Index i deleted
# drop(): Compute new Index by deleting passed values
# insert(): Compute new Index by inserting element at Index i
# is_monotonic: Returns True if each element is greater than or equal to the previous element
# is_unique: Returns True if Index has no duplicate values
# unique(): Compute the array of unique values in the Index

In [ ]:
# 5.2 Essential Functionality
# This section is for fundamental mechanics of interacting with the data contained in a Series of DataFrame.

In [ ]:
# Reindexing: creating a new object to align with new index
import pandas as pd
obj = pd.Series([4.5,7.2,-5.3,3.6],index=["d","b","a","c"])
obj

In [ ]:
obj2 = obj.reindex(["a","b","c","d","e"])
obj2

In [ ]:
# ffill, forward-filling values
obj3 = pd.Series(["blue","purple","yellow"],index=[0,2,4])
obj3

In [ ]:
# arange(6): generating an array from 0 to 6
# refering to the former index, "forward-filling" with the extended reindex
import numpy as np
obj3.reindex(np.arange(6),method="ffill")

In [ ]:
# with DataFrame, reindex can alter the index (row), columns, or both
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
        index=["a","c","d"],
        columns=["Ohio","Texas","California"])
frame

In [ ]:
frame2 = frame.reindex(index=["a","b","c","d"])
frame2

In [ ]:
# column reindexing
states = ["Texas","Utah","California"]
frame.reindex(columns=states)

In [ ]:
# another way of reindexing an axis: pass the new axis labels as a positional argument --> specify the axis
# axis="columns" or axis="rows"
frame.reindex(states,axis="columns")

In [ ]:
# reindex funciton arguments
# labels: New sequence to use as n index
# index: Use the passed sequence as the new index labels
# columns: Use the passed sequence as the new column labels
# axis: The axis to reindex, either "columns" or "rows"
#       reindex(index=new_labels) or reindex(columns=new_labels)
# method: filling method; ffill = forward fill, bfill = backwards fill
# fill_value: specifying value to show missing data / fill_value='missing' --> null values will show 'missing'
# limit: when forward or backward filling, setting max size gap in number of elements to fill
# tolerance: when ffill or bfill, setting max size gap to fill for inexact matches
# level: match simple index on level of Multiindex; otherwise select subset of
# copy: if True, always copy underlying data even if the new index == old index
#       if False, do not copy data when the indexes are equivalent

In [ ]:
# a common way, when new index labels already exist in the DataFrame,
# is using loc operator
# loc[row_labels, column_labels]
frame.loc[["a","d","c"],["California","Texas"]]

In [ ]:
# dropping entries from an Axis
obj = pd.Series(np.arange(5.),index=["a","b","c","d","e"])
obj

In [ ]:
new_obj = obj.drop("c")
new_obj

In [ ]:
obj.drop(["d","c"])

In [ ]:
# with DataFrame, index value can be deleted from either axis
data = pd.DataFrame(np.arange(16).reshape((4,4)),
        index=["Ohio","Colorado","Utah","New York"],
        columns=["one","two","three","four"])
data

In [ ]:
# calling drop with a sequence labels
data.drop(index=["Colorado","Ohio"])

In [ ]:
# dropping labels from the columns
data.drop(columns=["two"])

In [ ]:
# dropping values from the columns by passing axis value / axis=0: row, axis=1: column
data.drop("two",axis=1)

In [ ]:
data.drop(["two","four"],axis="columns")

In [ ]:
# Indexing, Selection, and Filtering
# using Serie's index values instead of integers
obj = pd.Series(np.arange(4.),index=["a","b","c","d"])
obj

In [ ]:
obj["b"]

In [ ]:
obj[1]

In [ ]:
obj[2:4]

In [ ]:
obj[["b","a","d"]]

In [ ]:
obj[[1,3]]

In [ ]:
obj[obj<2]

In [ ]:
# selecting index values using loc operator
obj.loc[["b","a","d"]]

In [ ]:
# the [ ] in indexing
obj1 = pd.Series([1,2,3],index=[2,0,1])
obj2 = pd.Series([1,2,3],index=["a","b","c"])

In [ ]:
obj1

In [ ]:
obj2

In [ ]:
# slicing with labels; endpoint is inclusive
obj2.loc["b":"c"]

In [ ]:
# assigning values using index slicing
obj2.loc["b":"c"] = 5
obj2

In [ ]:
# NOTE: It can be a common error to try to call loc or iloc like functions rather than "indexing into" them with square brackets.
# The square bracket notation is used to enable slice operations and to allow for indexing on multiple axes with DataFrame objects.

In [ ]:
# Indexing into a DataFrame retreives one or more columns either with single value or sequence
data = pd.DataFrame(np.arange(16).reshape((4,4)),
        index=["Ohio","Colorado","Utah","New York"],
        columns=["one","two","three","four"])
data

In [ ]:
data["two"]

In [ ]:
# Sequence should always be in middle bracket [ ]
data[["three","one"]]

In [ ]:
# index slicing or selecting data with a Boolean array
# Passing a single element or a list to the [ ] operator select columns
data[:2]

In [ ]:
# in "three" column where value is > 5
data[data["three"] > 5]

In [ ]:
# indexing with Boolean DataFrame, produced by a scalar comparison
data < 5

In [ ]:
# Using DataFrame to assign the value 0 with the value True
data[data <5] = 0
data

In [ ]:
# Selection on DataFrame with loc and iloc / selecting a subset of rows and columns
# axis labels (loc) / integers (iloc)

In [ ]:
data

In [ ]:
# selecting in a single row is a Series with an index taht contains DataFrame's column labels
data.loc["Colorado"]

In [ ]:
# to select multiple roles, creating a new DataFrame, pass a sequence of labels
data.loc[["Colorado","New York"]]

In [ ]:
# can combine both row and column selection in loc by separating the selections within a comma
data.loc["Colorado",["two","three"]]

In [ ]:
# integers using iloc / pulling 3rd row, with iloc[2]
data.iloc[2]

In [ ]:
data.iloc[[2,1]]

In [ ]:
data.iloc[2,[3,0,1]]

In [ ]:
data.iloc[[1,2],[3,0,1]]

In [ ]:
# both indexing functions work with slices in addition to single labels or lists of labels
data.loc[:"Utah","two"]

In [ ]:
data.iloc[:,:3][data.three > 5]

In [ ]:
# Boolean arrays can be used with loc but not iloc
data.loc[data.three >= 2]

In [ ]:
# Indexing options with DataFrame
# df[column]: Select single column or sequence of columns from the DataFrame
# df.loc[rows]: Select single row or subset of rows from the DataFrame by label
# df.loc[:,columns]: Seelect single column or subset of columns by label
# df.loc[rows,columns]: Select both rows and columns by label
# df.iloc[rows]: Select single row or subset of rows from the DataFrame by integer position
# df.iloc[:,columns]: Select single column or subset of columns by integer position
# df.iloc[rows,columns]: Select both rows and columns by integer position
# df.at[rows,columns]: Select a single scalar value by row and column label
# df.iat[rows,columns]: Select a single scalar value by row and column position (integers)
# reindex method: Select either rows or columns by labels

In [ ]:
# Integer indexing pitfalls

import pandas as pd
import numpy as np

ser = pd.Series(np.arange(3.))
ser

In [ ]:
# Pandas objects indexed by integers canbe different from built-in Python data structures like list and tuples

ser[-1]

In [ ]:
ser

In [ ]:
# with a noninteger index, there is no such ambiguity

ser2 = pd.Series(np.arange(3.0),index=["a","b","c"])
ser2[-1]

In [ ]:
# if you have an axis index containing integers, data selection will always be label oriented

ser.iloc[-1]

In [ ]:
# on the other hand, slicing with integer is always integer oriented
# It is best always to index with loc and iloc to avoid ambiguity

ser[:2]

In [ ]:
# pitfalls with chained indexing

data = pd.DataFrame(np.arange(16).reshape((4,4)),
        index=["Ohio","Colorado","Utah","New York"],
        columns=["one","two","three","four"])
data

In [ ]:
data.loc[:,"one"] = 1
data

In [ ]:
data.iloc[2] = 5
data

In [ ]:
data.loc[data["four"]>5] = 3
data

In [ ]:
# data is unmodified as it suggests to use .loc instead
# This is called SettingWithCopyWarning

data.loc[data.three == 5]["three"] = 6
data

In [ ]:
# the fix is to rewrite the chained assignment to use a single loc operation
# and a good rule of thumb is to avoid chained indexing in general

data.loc[data.three == 5,"three"] = 6
data

In [ ]:

# Arithmetic and Data Alignment

In [ ]:
# pandas makes it much simpler to work with objects that have different indexes
# When adding objects, if any object paris are not the same, the respective index in the result will be the union of index pairs

s1 = pd.Series([7.3,-2.5,3.4,1.5],index=["a","c","d","e"])
s2 = pd.Series([-2.1,3.6,-1.5,4,3.1],index=["a","c","e","f","g"])

s1

In [ ]:
s2

In [ ]:
# adding 2 series

s1 + s2

In [ ]:
# internal data alignment introduces missing values in the label locations that don't overlap

In [ ]:

# Operation between DataFrame and Series

In [ ]:
arr = np.arange(12.).reshape((3,4))
arr

In [ ]:
arr[0]

In [ ]:
arr - arr[0]

In [ ]:
# subtracting performed for each row, is called broadcasting
# operations between a DataFrame and Series are similar

frame = pd.DataFrame(np.arange(12.).reshape((4,3)),
            columns=list("bde"),
            index=["Utah","Ohio","Texas","Oregon"])
frame

In [ ]:
series = frame.iloc[0]
series

In [ ]:
# by default, arithmetic between DataFrame and Series matches the index of the Series on the columns of the DataFrame, broadcasting down the rows
frame - series

In [ ]:
# if index value not found the objects will be reindexed to form the union
series2 = pd.Series(np.arange(3),index=["b","e","f"])
series2

In [ ]:
frame + series2

In [ ]:
# broadcasting over the columns, match on the rows
# need to specify to match over the index
series3 = frame["d"]
frame

In [ ]:
series3

In [ ]:
frame.sub(series3,axis="index")

In [ ]:

# Function Application and Mapping

In [ ]:
# ufunc: universal functioning - element-wise operations on entire arrays or DataFrames
# universally applicable to every element in the array (or DataFrame)
# ufunc: Function(Data_All_At_Once) (applying to all elements)

In [ ]:
# Numpy ufuncs (element-wise array methods) also work with pandas objects
frame = pd.DataFrame(np.random.standard_normal((4,3)),
            columns=list("bde"),
            index=["Utah","Ohio","Texas","Oregon"])
frame

In [ ]:
# np.abs(): no negative filter, absolute value
np.abs(frame)

In [ ]:
# another frequent operation is applying a function on one-dimensional arrays to each column or row
# function f1 is invoked on each column in frame
# result is a Series having the columns of frame as index
def f1(x):
    return x.max() - x.min()

In [ ]:
frame.apply(f1)

In [ ]:
# if pass axis="columns", function will invoke once per row instaed
frame.apply(f1,axis="columns")

In [ ]:
# many of the most common array statistics (sum, mean) are DataFrame methods
# so using .apply is not necessary
def f2(x):
    return pd.Series([x.min(),x.max()],
    index=["min","max"])
frame.apply(f2)

In [ ]:
# element-wise functions
# computing a formatted string from each floating point value in frame
# using .applymap()

def my_format(x):
    return f"{x:.2f}"

# f"..." : formatting
# { } : placeholder, to take value from
# ":" : separator
# ".2f" : the specific instruction - .2 = keep exactly 2 decimal points; f: treat number as fixed-point (floating point) number

In [ ]:
# using .applymap() / applying ufunc
frame.applymap(my_format)

In [ ]:
# Series has a map method for applying element-wise function
# so, for DatraFrame applymap() is separately used
# Series.map()
# DataFrame.applymap()
frame["e"].map(my_format)

In [ ]:

# Sorting and Ranking

In [ ]:
import pandas as pd
import numpy as np

obj = pd.Series(np.arange(4),index=["d","a","b","c"])
obj

In [ ]:
obj.sort_index()

In [ ]:
# for DataFrame, sorting can be done on either axis
frame = pd.DataFrame(np.arange(8).reshape((2,4)),
        index=["three","one"],
        columns=["d","a","b","c"])
frame

In [ ]:
frame.sort_index()

In [ ]:
frame.sort_index(axis="columns")

In [ ]:
# sorting in descending order
frame.sort_index(axis="columns",ascending=False)

In [ ]:
# sorting Series by values; sort_values method
obj = pd.Series([4,7,-3,2])
obj

In [ ]:
obj.sort_values()

In [ ]:
# by defualt, missing values (NaN) are sorted to the end of Series
obj = pd.Series([4,np.nan,7,np.nan,-3,2])
obj

In [ ]:
obj.sort_values()

In [ ]:
# placing NaN values to the start
obj.sort_values(na_position="first")

In [ ]:
# sorting a DataFrame - can use the data in one or more columns as the sort keys
# pass one or more column names to sort_values()
frame = pd.DataFrame({"b":[4,7,-3,2],"a":[0,1,0,1]})
frame

In [ ]:
frame.sort_values("b")

In [ ]:
# sort by multiple columns; pass a list of names
frame.sort_values(["a","b"])

In [ ]:
# ranking; basically refers to Series and DataFrame values
# but breaks ties by assigning each group the mean rank
obj = pd.Series([7,-5,7,4,2,0,4])
obj

In [ ]:
obj.rank()

In [ ]:
# ranks are expressed in floats to note the "overlapping" ranks (ties)
# assigning ranking order; here, there's ranking based on order of labels, even for overlapping ones
obj.rank(method="first")

In [ ]:
# ranking in descending order
obj.rank(ascending=False)

In [ ]:
# Tie-breaking methods with rank
# "average" : Default: assign the average rank to each entry in the equal group
# "min" : Use the minimum rank for the whole group
# "max" : Use the maximum rank for the whole group
# "first" : Assign ranks in the order the values appear in the data
# "dense" : Like method = "min", but ranks always increase by 1 between groups rather than the number of equal elemnts in a group

In [ ]:
# DataFrame can compute ranks over the rows or the columns
frame = pd.DataFrame({"b":[4.3,7,-3,2],"a":[0,1,0,1],"c":[-2,5,8,-2.5]})
frame

In [ ]:
frame.rank(axis="columns")

In [ ]:

# Asix Indexes with Duplicate Labels

In [ ]:
# index labels to be unique is not mandatory, meaning, there could be duplicates
# Let's look at a Series with duplicate indices
obj = pd.Series(np.arange(5),index=["a","a","b","b","c"])
obj

In [ ]:
# is_unique command to see whether labels are unique
obj.index.is_unique

In [ ]:
# Data selection behaves differently with duplicates
# Indexing a label with multiple entries returns a Series
# Indexing a unique label return a scalar value
obj["a"]

In [ ]:
obj["c"]

In [ ]:
# same logic extends to indexing rows or columns in DataFrame
df = pd.DataFrame(np.random.standard_normal((5,3)),
        index=["a","a","b","b","c"])
df

In [ ]:
df.loc["b"]

In [ ]:
df.loc["c"]

In [ ]:

# Summarizing and Computing Descriptive Statistics

In [70]:
# Pandas has built-in math & statistiacl methods, for reductions/summary statistics
# methods for extracting single value or Series of values from rows & columns or DataFrame
# Pandas has built-in handling for missing data

df = pd.DataFrame([[1.3,np.nan],[7.1,-4.5],
                  [np.nan,np.nan],[0.75,-1.3]],
                 index=["a","b","c","d"],
                 columns=["one","two"])
df

    one  two
a  1.30  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [ ]:
# DataFrame's sum() method
# sum() skips teh NaN values
df.sum()

In [ ]:
# passing axi"s="columns" or axis=1 sums across the columns instead
df.sum(axis="columns")

In [ ]:
# when an entire row or column contains all NA values, sum is 0
# if any value is not NA, the sum is NA
# to disable NA result, skipna option is used
df.sum(axis="index",skipna=False)

In [ ]:
df.sum(axis="columns",skipna=False)

In [ ]:
# mean requires at least one non-NA valeu
df.mean(axis="columns")

In [ ]:
# options for reduction methods
# axis : axis to reduce over; "index" for DataFrame's rows and "columns" for columns
# skipna : Exclude missing values; True by default
# level : reduce grouped by level if the axis is hierarchically indexed (multiindexed)

In [71]:
# some methods return indirect statistics; index value where min or max values
# idxmin / idxmax

df.idxmax()

# these run the max or min value for EACH COLUMN

one    b
two    d
dtype: object

In [72]:
# by default, df.idxmax() is df.idxmax(axis=0)
# "Which column had the highest value for row 'b'?"
df.idxmax(axis=1)

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_120\608378233.py:3: FutureWarning: The behavior of DataFrame.idxmax with all-NA values, or any-NA and skipna=False, is deprecated. In a future version this will raise ValueError
  df.idxmax(axis=1)

a    one
b    one
c    NaN
d    one
dtype: object

In [74]:
# accumulation of columns method: cumsum()
df.cumsum()

    one  two
a  1.30  NaN
b  8.40 -4.5
c   NaN  NaN
d  9.15 -5.8

In [75]:
# some methods are neither reductions nor accumulations
# describe() produces multiple summary statistics in one shot
df.describe()

            one       two
count  3.000000  2.000000
mean   3.050000 -2.900000
std    3.518167  2.262742
min    0.750000 -4.500000
25%    1.025000 -3.700000
50%    1.300000 -2.900000
75%    4.200000 -2.100000
max    7.100000 -1.300000

In [76]:
# for nonnumeric data, describe() produces alternative summary statistics
obj = pd.Series(["a","a","b","c"]*4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [77]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [79]:
# list of summary statistics and related methods
# count() : number of non-NA values
# describe() : compute set of summary statistics
# min(), max() : compute minimum and maximum values
# argmin(), argmax() : compute index locations (integers) at which minimum or maximum value is obtained, respectively;
#                      Notavailable on DataFrame objects
# idxmin(), idxmax() : compute index labels at which minimum or maximum value is obtained, respectively
# quantile() : compute sample quantile ranging from 0 to 1 (default: 0.5)
# sum() : sum of values
# mean() : mean of values
# median() : arithmetic median (50% quantile) of values
# mad() : mean absolute deviation from mean value
# prod() : product of all values
# var() : sample variance of values
# std() : sample standard deviation of values
# skew() : sample skewness (third moment) of values
# kurt() : sample kurtosis (fourth moment) of values
# cumsum() : cumulative sum of values
# cummin(), cummax() : cumulative minimum or maximum of values, respectively
# cumprod() : cumulative product of values
# diff() : compute arithmetic difference (useful for time series)
# pct_change() : compute percent changes

In [80]:

# correlation and covariance

In [84]:
# example: DataFrames of stock prices and volumes from Yahoo! Finance
# available in binary Python pickle files

price = pd.read_pickle("examples/yahoo_price.pkl")
price

                  AAPL        GOOG         IBM       MSFT
Date
2010-01-04   27.990226  313.062468  113.304536  25.884104
2010-01-05   28.038618  311.683844  111.935822  25.892466
2010-01-06   27.592626  303.826685  111.208683  25.733566
2010-01-07   27.541619  296.753749  110.823732  25.465944
2010-01-08   27.724725  300.709808  111.935822  25.641571
...                ...         ...         ...        ...
2016-10-17  117.550003  779.960022  154.770004  57.220001
2016-10-18  117.470001  795.260010  150.720001  57.660000
2016-10-19  117.120003  801.500000  151.259995  57.529999
2016-10-20  117.059998  796.969971  151.520004  57.250000
2016-10-21  116.599998  799.369995  149.630005  59.660000

[1714 rows x 4 columns]

In [86]:
volume = pd.read_pickle("examples/yahoo_volume.pkl")
volume

                 AAPL      GOOG       IBM      MSFT
Date
2010-01-04  123432400   3927000   6155300  38409100
2010-01-05  150476200   6031900   6841400  49749600
2010-01-06  138040000   7987100   5605300  58182400
2010-01-07  119282800  12876600   5840600  50559700
2010-01-08  111902700   9483900   4197200  51197400
...               ...       ...       ...       ...
2016-10-17   23624900   1089500   5890400  23830000
2016-10-18   24553500   1995600  12770600  19149500
2016-10-19   20034600    116600   4632900  22878400
2016-10-20   24125800   1734200   4023100  49455600
2016-10-21   22384800   1260500   4401900  79974200

[1714 rows x 4 columns]

In [87]:
returns = price.pct_change()
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [88]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

In [89]:
# the corr method of Series computes the correlation of the overlapping, non-NA, aligned-by-index values in two Series
# relatedly, cov computes the covariance
# correlation is unitless, and covariance is scale-dependent (direction and scale of moving togethter)
returns["MSFT"].corr(returns["IBM"])

np.float64(0.4997636114415114)

In [90]:
returns["MSFT"].cov(returns["IBM"])

np.float64(8.870655479703546e-05)

In [91]:
# DataFrame's corr() and cov() methods, return a full corr or cov matrix as a DataFrame, respectively
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [92]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [93]:
# corrwith() method can compute pair-wise correlations between a DataFrame's columns or rows with another Series or DataFrame
# passing a Series returns a Series with the correlation value computed for each column
returns.corrwith(returns["IBM"])

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [94]:
# passing a DataFrame computes the corrleations of matching column names
# computing correlations of percent changes (returns) with volume
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

In [95]:
# passing axis="columns" does things row-by-row instead

In [96]:

# Unique Values, Value Counts, and Membership

In [97]:
# extracting information about values contained in a one-dimentional Series
obj = pd.Series(["c","a","d","a","a","b","b","c","c"])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [99]:
uniques = obj.unique()
uniques

# the unique values are not necessarily returned in the order in which they first appear
# but could be sorted after the fact if needed (uniques.sort())

array(['c', 'a', 'd', 'b'], dtype=object)

In [100]:
# value-counts computes a Series containing value frequencies
# as a convenience Series is sorted by vaulue in descending order
obj.value_counts()

c    3
a    3
b    2
d    1
Name: count, dtype: int64

In [101]:
# value_counts() can also be used as top-level pandas with NumPy arrays or other Python sequences
pd.value_counts(obj.to_numpy(),sort=False)

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_120\2972380295.py:2: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(obj.to_numpy(),sort=False)

c    3
a    3
d    1
b    2
Name: count, dtype: int64

In [102]:
# isin() performs a vectorized set membership check
# can be useful filtering a dataset down to a subset of values in Series or column in a DataFrame
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [103]:
mask = obj.isin(["b","c"])
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [104]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [108]:
# "index".get_indexer() method : gives an index array from an array of possibly nondistinct values into another array of distinct values
to_match = pd.Series(["c","a","b","b","c","a"])
unique_vals = pd.Series(["c","b","a"])
to_match

0    c
1    a
2    b
3    b
4    c
5    a
dtype: object

In [109]:
unique_vals

0    c
1    b
2    a
dtype: object

In [110]:
# to_match is the data given in this case
# unique_vals is the index map to assign index values corresponding to to_match values

indices = pd.Index(unique_vals).get_indexer(to_match)
indices

array([0, 2, 1, 1, 0, 2])

In [111]:
# the reason with complex indexing is for: machine learning readability, database integrity, anonymization

In [112]:
# unique, value counts, and set membership methods
# isin() : compute a Boolean array indicating whether each Series or DataFrame value is contained in the passed sequence of values
# get_indexer() : compute integer indices for each value in an array into another array of distinct values;
#                 helpful for data alignment and join-type operations
# unique() : compute an array of unique values in a Series, returned in the order observed
# value_counts() : return a Series containing unique values as its index and frequencies as its values;
#                  ordered count in descending order

In [113]:
# computing a histogram on multiple related columns in a DataFrame

data = pd.DataFrame({"Qu1":[1,3,4,3,4],
                     "Qu2":[2,3,1,2,3],
                     "Qu3":[1,5,2,4,4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [114]:
# computing value counts for a single column, .value_counts()
# .value_counts() returns a frequency of certain values in observations
data["Qu1"].value_counts().sort_index()

Qu1
1    1
3    2
4    2
Name: count, dtype: int64

In [115]:
# computing for all columns - pass pandas.valuecounts() to the DataFrame's apply method
# .apply() allows to apply a function along an axis of a DataFrame or Series
result = data.apply(pd.value_counts).fillna(0)
result

# the row labels in the result are the distinct values occurring in all of the columns
# the values are the respective counts of these values in each column

C:\Users\Public\Documents\ESTsoft\CreatorTemp\ipykernel_120\2727995399.py:3: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  result = data.apply(pd.value_counts).fillna(0)

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [117]:
# DataFrame.value_counts method; 
# it computes counts considering each row of the DataFrame as a tuple to determine the number of occurrences of each distinct row
data = pd.DataFrame({"a":[1,1,1,2,2],"b":[0,0,1,0,0]})
data

   a  b
0  1  0
1  1  0
2  1  1
3  2  0
4  2  0

In [118]:
data.value_counts()

# simply put, returning the tuple frequency in the DataFrame

a  b
1  0    2
2  0    2
1  1    1
Name: count, dtype: int64